{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "decoder", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_53"}, "name": "input_layer_53", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_53", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_53", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["input_layer_53", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Reshape", "config": {"name": "reshape_26", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "target_shape": [8, 8, 64]}, "name": "reshape_26", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 4096], "dtype": "float32", "keras_history": ["dense_53", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_78", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_transpose_78", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 8, 8, 64], "dtype": "float32", "keras_history": ["reshape_26", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_79", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_transpose_79", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 64], "dtype": "float32", "keras_history": ["conv2d_transpose_78", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_80", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_transpose_80", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 32], "dtype": "float32", "keras_history": ["conv2d_transpose_79", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_53", 0, 0]], "output_layers": [["conv2d_transpose_80", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_transpose_78/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_78/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_79/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_transpose_79/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_transpose_80/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_transpose_80/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_53/kernel", "shape": [64, 4096], "dtype": "float32"}, {"name": "dense_53/bias", "shape": [4096], "dtype": "float32"}]}]}